Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.GetSegmentEndReferenceType(System.Int32)
Choice of two possibilities for the start and end references of the length constraint.
index:
Which reference on the constraint. Either 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not 0 or 1.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.Direction
A vector specifying the direction of the constraint. The direction is fixed,
and the shape is always constructed so that the segment
direction has a positive dot product with this vector.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.TripleProductSign
Sign of the z-coordinate of the cross
product of the Direction property with the segment vector.
TripleProductSign is 1 if the segment direction is to be on the left of
the constraint direction,
or -1 if the segment direction is to be on the right.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.UV,System.Int32,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType)
Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape
parameter, direction, and reference types.
paramId:
The Id of a Rebar Shape parameter.
direction:
A vector specifying the direction of the constraint. The direction is fixed,
and the shape is always constructed so that the segment's
direction has a positive dot product with this vector.
tripleProductSign:
Sign of the z-coordinate of the cross
product of the "direction" argument with the segment vector. In other words,
1 if the segment direction is to be on the left of the constraint direction,
or -1 if the segment direction is to be on the right.
refType0:
Choose between two possibilities for the first reference of the length constraint.
refType1:
Choose between two possibilities for the second reference of the length constraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
-or-
tripleProductSign is not 1 or -1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
direction has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
A constraint that measures the length of a segment as measured by projecting onto a direction
that is not parallel to the segment.
Remarks:
The constraint has two references, indexed by 0 and 1, that do not have to
correspond to the start and end of the segment. The constraint also specifies
a direction as a 2D vector, which is not necessarily parallel to the segment,
but must point from the segment's start toward its end.
Since:
2012